In [1]:
import pandas as pd
import numpy as np
from numpy import random

### Pandas Data Structures: Series and DataFrame

In [ ]:
# Series:  A one-dimensional labeled array
s = pd.Series([1, 2, 3, 4, 5])
s

In [ ]:
calories = {
    "d1": 234,
    "d2": 687,
    "d3": 890,
}
var = pd.Series(calories, index = ["d2","d1"])
print(var)

In [ ]:
a = np.random.randint(10,20,10)
var = pd.Series(a)
print(var)

# index

var = pd.Series(a, index=[x for x in range(1,11)])
print(var)

In [ ]:
# DataFrame: A two-dimensional table of data with labeled axes (rows and columns)
dataframe = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
})

### Creating DataFrames

In [ ]:
data = {'Name': ['John', 'Anna', 'Peter'],
        'Age': [28, 24, 35]}
df = pd.DataFrame(data)

### Inspecting DataFrames

In [ ]:
df.head()   # First 5 rows
df.tail()   # Last 5 rows
df.info()   # Provides an overview of the DataFrame, including column names, data types, and memory usage
df.describe() # Provides summary statistics (mean, standard deviation, etc.) for numerical columns

### Indexing and Slicing

In [ ]:
df['Name']    # Select one column
df[['Name', 'Age']]   # Select multiple columns

In [ ]:
# Selecting rows using .iloc and .loc
df.iloc[0]  # First row

In [ ]:
df.loc[0]   # First row

### Data Cleaning and Preprocessing

In [ ]:
# Handling missing values
# .isnull() and .notnull() to detect missing values
df.isnull().sum()  # Check how many null values are in each column

In [ ]:
# .fillna() to replace missing values with a specific value
df['Age'].fillna(df['Age'].mean(), inplace=True)  # Replace nulls with mean

In [ ]:
# .dropna() to remove rows or columns with missing data
df.dropna(inplace=True)

In [ ]:
# Renaming columns
df.rename(columns={'old_name': 'new_name'}, inplace=True)

### Filtering and Conditional Selection

In [ ]:
# Filtering rows based on conditions
df[df['Age'] > 25]  # Select rows where 'Age' > 25

In [ ]:
# Multiple conditions using & (and), | (or)
df[(df['Age'] > 25) & (df['City'] == 'New York')]

### Sorting and Ordering

In [ ]:
# Sorting by a specific column
df.sort_values('Age', ascending=False)

In [ ]:
# Sorting by multiple columns
df.sort_values(['City', 'Age'], ascending=[True, False])

### Aggregation and Grouping

In [ ]:
# .groupby() Used to group data by one or more columns and apply aggregation functions like mean, sum, count
df.groupby('City')['Age'].mean()  # Group by 'City' and compute mean of 'Age'

In [ ]:
# .agg() Allows you to apply multiple aggregation functions at once.
df.groupby('City').agg({'Age': ['mean', 'max'], 'Salary': 'sum'})

### Merging, Joining, and Concatenation

In [ ]:
# Merging DataFrames
# For example if we have two DataFrames 'df1' and 'df2'
pd.merge(df1, df2, on='common_column')

In [ ]:
# Concatenating DataFrames
# For example if we have two DataFrames 'df1' and 'df2'
pd.concat([df1, df2], axis=0)  # Vertical stack
pd.concat([df1, df2], axis=1)  # Horizontal stack

### Working with Dates and Times

In [ ]:
# Converting strings to datetime
df['date_column'] = pd.to_datetime(df['date_column'])

In [ ]:
# Extracting components (year, month, day)
df['year'] = df['date_column'].dt.year
df['month'] = df['date_column'].dt.month

In [ ]:
# Resampling time series data
df.resample('M').mean()  # 'M' stands for month

### Pivot Tables

In [ ]:
# pivot tables in Pandas allow for data summarization
df.pivot_table(index='City', columns='Gender', values='Age', aggfunc='mean')

### Visualization with Pandas

In [ ]:
df['Age'].plot(kind='hist')
df.plot(x='Age', y='Salary', kind='scatter')

### Exporting Data

In [ ]:
df.to_csv('output.csv', index=False)     # To CSV

In [ ]:
df.to_excel('output.xlsx', index=False)     # To Excel

### Advanced Pandas Features

In [ ]:
# Multi-indexing (Hierarchical Indexing) Pandas allows you to work with data at multiple levels of indexing
df.set_index(['City', 'Gender'], inplace=True)

In [ ]:
# Window Functions Used for rolling and expanding operations
df['rolling_avg'] = df['Age'].rolling(window=3).mean()  # 3-row rolling average

### Import and Read the file

In [ ]:
import os
# os.mkdir("C:\\")         # File Path

### Link to Dataset

In [ ]:
# https://www.kaggle.com/datasets/fathyfathysahlool/calories-and-pulse

In [ ]:
df = pd.read_csv("./Data/data.csv")
print(df)
# print(df.to_string())

In [ ]:
# Process to first create and then read .csv file
Stu_dta = {
    "names": ["Ali","Aziz","Abdullah","Qasim","Sultan"],
    "marks": [x for x in random.randint(50,100,5)],
    "citys": ["Bahawalpur", "jpj", "Gujrat", "Ali pur", "Bashir wala"]
}
df = pd.DataFrame(Stu_dta)
# print(df)
# df.to_csv("./Data/Student_data.csv", index=False)
df = pd.read_csv("./Data/Student_data.csv")
print(df.to_string())

In [ ]:
# Practice on creating and reading data
df = pd.read_csv("./Data/data.csv")
# print(df.to_string())
df.head(5)
# df.tail(5)

### Practice

In [ ]:
# To access specific column
df["Pulse"]
df["Pulse"][2]

In [ ]:
# Randomly Generate DataFrame
new_df = pd.DataFrame(np.random.rand(300,5), index = np.arange(300))
new_df

In [ ]:
# Basica Analysis of data
new_df.describe()
new_df.info()

In [ ]:
# Creating DataFrame with Series
new_data = pd.DataFrame({"Name": pd.Series(["Adam","Eve"]),"age": pd.Series([12,34])})
print(new_data)

In [ ]:
# Accessing index and columns of data
new_data.index
new_data.columns

In [ ]:
# Basic Analysis 
new_df[:5]  
new_df.index.array
new_df.to_numpy()    
new_df.columns
new_df["Duration"][3] 
new_df["Duration"][3] = 45
new_df

In [ ]:
# collect specific data
new_df.loc[[1,2,3],[3,4]]
new_df.loc[5:11,:]

In [ ]:
new_df.iloc[1,2]

In [ ]:
new_df.drop(3,axis=1)

### Data Cleaning
#### Dropena and fillna

In [20]:
# Uncomment the line and run the code

var = pd.read_csv("./Data/data.csv")
# var.dropna() # Drop => rows
# print(var.dropna(axis=1)) # Drop columns
# print(var.dropna(axis=0)) # Drop rows

300.0

In [21]:
var = pd.read_excel("./Data/data.xlsx")
var
# var.loc[1,"Calories"]
# var.dropna()

     Duration  Pulse  Maxpulse  Calories
0        60.0  110.0     130.0     409.1
1         NaN    NaN       NaN       NaN
2        60.0  103.0     135.0     340.0
3        45.0    NaN     175.0     282.4
4        45.0  117.0     148.0     406.0
..        ...    ...       ...       ...
164      60.0  105.0     140.0     290.8
165      60.0  110.0     145.0     300.0
166      60.0  115.0     145.0     310.2
167      75.0  120.0     150.0     320.4
168      75.0  125.0     150.0     330.4

[169 rows x 4 columns]

In [22]:
import math
var.dropna(subset=["Duration"])
var.dropna(thresh = 20)
var.loc[0:5]
# var["Duration"].mode
var = pd.read_excel("./Data/data.xlsx")
var.loc[1:5]
var.fillna({"Duration": round(var["Duration"].mean(),1),
            "Pulse": round(var["Pulse"].mean(),1),
            "Maxpulse": round(var["Maxpulse"].median(),1),
            "Calories": round(var["Calories"].median(),1),            
            })

     Duration  Pulse  Maxpulse  Calories
0        60.0  110.0     130.0     409.1
1        63.9  107.4     131.0     318.0
2        60.0  103.0     135.0     340.0
3        45.0  107.4     175.0     282.4
4        45.0  117.0     148.0     406.0
..        ...    ...       ...       ...
164      60.0  105.0     140.0     290.8
165      60.0  110.0     145.0     300.0
166      60.0  115.0     145.0     310.2
167      75.0  120.0     150.0     320.4
168      75.0  125.0     150.0     330.4

[169 rows x 4 columns]

In [23]:
# If you want to replace value with previous one then
var.fillna(method="ffill")
# If you want to replace value with after one then
var.fillna(method="bfill")
var.fillna(method="bfill", axis=0)

     Duration  Pulse  Maxpulse  Calories
0        60.0  110.0     130.0     409.1
1        60.0  103.0     135.0     340.0
2        60.0  103.0     135.0     340.0
3        45.0  117.0     175.0     282.4
4        45.0  117.0     148.0     406.0
..        ...    ...       ...       ...
164      60.0  105.0     140.0     290.8
165      60.0  110.0     145.0     300.0
166      60.0  115.0     145.0     310.2
167      75.0  120.0     150.0     320.4
168      75.0  125.0     150.0     330.4

[169 rows x 4 columns]

# Replace & interpolate

In [24]:
import pandas as pd
import numpy as np
from numpy import random
import os
import matplotlib.pyplot as plt

In [25]:
# newdf = pd.DataFrame(round(np.random.rand(300,5), 2), index = np.arange(300))
nd = pd.DataFrame(np.random.rand(300,5), index=np.arange(300))
nd

            0         1         2         3         4
0    0.476362  0.985416  0.060468  0.574165  0.557431
1    0.183175  0.767163  0.044329  0.002265  0.767461
2    0.803194  0.200885  0.009380  0.275634  0.159728
3    0.987786  0.581273  0.236645  0.806201  0.803362
4    0.490131  0.986738  0.360924  0.456026  0.746548
..        ...       ...       ...       ...       ...
295  0.505143  0.449867  0.921126  0.241650  0.338663
296  0.678471  0.693432  0.077435  0.213640  0.135497
297  0.416474  0.174780  0.366998  0.456196  0.132509
298  0.261517  0.151926  0.961590  0.228566  0.049301
299  0.855769  0.495865  0.812556  0.735209  0.871317

[300 rows x 5 columns]

In [26]:
data = pd.read_excel("./Data/data.xlsx")
# data
# data.dropna()
# data.dropna(subset="Calories")

data.replace(to_replace=110, value=1000)

     Duration   Pulse  Maxpulse  Calories
0        60.0  1000.0     130.0     409.1
1         NaN     NaN       NaN       NaN
2        60.0   103.0     135.0     340.0
3        45.0     NaN     175.0     282.4
4        45.0   117.0     148.0     406.0
..        ...     ...       ...       ...
164      60.0   105.0     140.0     290.8
165      60.0  1000.0     145.0     300.0
166      60.0   115.0     145.0     310.2
167      75.0   120.0     150.0     320.4
168      75.0   125.0     150.0     330.4

[169 rows x 4 columns]

In [27]:
x = data["Calories"].isnull()
x[0:5]
# y = 110
# data.replace(to_replace=x, value=y)
# data.isnull().sum()
data["Calories"].dropna()
data

     Duration  Pulse  Maxpulse  Calories
0        60.0  110.0     130.0     409.1
1         NaN    NaN       NaN       NaN
2        60.0  103.0     135.0     340.0
3        45.0    NaN     175.0     282.4
4        45.0  117.0     148.0     406.0
..        ...    ...       ...       ...
164      60.0  105.0     140.0     290.8
165      60.0  110.0     145.0     300.0
166      60.0  115.0     145.0     310.2
167      75.0  120.0     150.0     320.4
168      75.0  125.0     150.0     330.4

[169 rows x 4 columns]

In [28]:
years = range(2014,2018)
shop1 = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=years)
shop2 = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=years)
shop3 = pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=years)
# pd.concat([shop1,shop2,shop3])
shop = pd.concat([shop1,shop2,shop3], axis=1)
# shop
cities = ["Zürich", "Winterthur", "Freiburg"]
# or
# shop1.name = "Zurich"
shop.columns = cities
shop

       Zürich  Winterthur  Freiburg
2014  2409.14     1203.45   3412.12
2015  2941.01     3441.62   3491.16
2016  3496.83     3007.83   3457.19
2017  3119.55     3619.53   1963.10

In [29]:
cities = {"name": ["London", "Berlin", "Madrid", "Rome", 
                   "Paris", "Vienna", "Bucharest", "Hamburg", 
                   "Budapest", "Warsaw", "Barcelona", 
                   "Munich", "Milan"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305, 1805681, 1803425, 1760433,
                         1754000, 1740119, 1602386, 1493900,
                         1350680],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France", "Austria", "Romania", 
                      "Germany", "Hungary", "Poland", "Spain",
                      "Germany", "Italy"]}

city = pd.DataFrame(cities)
# city
# city.columns.values

# city.rename(columns={"name":"Soyadı", 
#                            "country":"Ülke", 
#                            "population":"Nüfus"}, inplace=True)
city_frame = pd.DataFrame(cities,columns=["name","population"],index=cities["country"])
# city_frame
# print(city_frame.loc["Spain"])
# con = city_frame.population
con = city_frame["population"] > 3000000
city_frame.loc[con]

           name  population
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235

In [30]:
con = city_frame["population"] > 2000000
con2 = city_frame["name"].str.contains("m")
# city_frame.loc[con & con2]
# city_frame.loc[con | con2]
# city_frame.loc['Switzerland'] = ['Zurich', 415215]
city.loc[13] = ['Zurich',415215,'Switzerland']
city.drop([-1],axis = 0)

In [ ]:
import numpy as np
years = range(2014, 2020)
cities = ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücken"]
shops = pd.DataFrame(index=years)
for city in cities:
    shops.insert(loc=len(shops.columns),
                 column=city,
                 value=(np.random.uniform(0.7, 1, (6)) * 1000).round(2))
    # print(len(shops.columns))
shops
# shops.sum()
s = shops.iloc[:,[1,2]]
s.sum(axis=1)

2014    1923.05
2015    1674.03
2016    1468.55
2017    1754.64
2018    1441.72
2019    1813.43
dtype: float64

In [ ]:

first = ('Mike', 'Dorothee', 'Tom', 'Bill', 'Pete', 'Kate')
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair')
job = ('data analyst', 'programmer', 'computer scientist', 
       'data scientist', 'accountant', 'psychiatrist')
language = ('Python', 'Perl', 'Java', 'Java', 'Cobol', 'Brainfuck')

df = pd.DataFrame(list(zip(last,job,language)),columns=["Last","Job","Languages"],index=first)
df

           Last                 Job  Languages
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist       Java
Pete       Meyr          accountant      Cobol
Kate       Mair        psychiatrist  Brainfuck

In [ ]:
df.loc["Bill","Job"]
# df.at["Tom","Last"]
df.loc["Kate","Job"] = "data analyst"
df.loc["Kate","Job"]
df.loc["Mery"] = ["Meyr","Auto eng.","Python"]
# df.loc["Abdul"] = ["Maier","","c++"]
# df.loc["salam"] = ["","Supply chain",""]
df.loc["Ali"] = [" ","Block chain"," "]
# df.loc["Bill","Last"]
# print(list(df.index.values))
print(df.columns.get_loc("Last"))

### Practice on Prize Bonds Data

In [ ]:
orignal =pd.DataFrame({
    "100": [x for x in range(509651,509700)],
    
    "750": [709688,709689,709690,709691,709692,
            709693,709694,709695,709696,709697,756025,806552,806553,806554,
            806555,901375,915271,999168],
    
})

additional = pd.DataFrame({
    "100_2": [x for x in range(517551,517600)],
})
additiona_2 = pd.DataFrame({
    "100_3": [x for x in range(526201,526300)]
})
additiona_3 = pd.DataFrame({
    "200": [480206,489481,490799,494736,500572,
            507947,523496,524665,534191,548503,565456,566722,597645,597646,
            597648,597649,597650,650343,673441,677654,677655,677656,677660,
            677668,719084,725605,731797,810586,912426,912427,930218,576471,
            250728,673448,679801,679804,901722,978226,797607,797356,798071,
            797560,109279,164563,'021391',577775,649422,671200,250728],
})
additiona_4 = pd.DataFrame({
    "200_2": [x for x in range(224101,224200)],
})
additiona_5 = pd.DataFrame({
    "1500": ['021397',106280,201308,485247,584445,675847,821113,821114,877318,
             877319,199747,'023246',551744,844327,293945,448470,908826]
})
new = pd.concat([orignal,additional,additiona_2,additiona_3,additiona_4,additiona_5], axis=1)

bd_data = pd.DataFrame(new)
# bd_data

Book_1 = pd.read_excel("C:\\bonds\\Book1.xlsx")
# Book_1.dropna().reset_index(drop=True)
C_col = Book_1["Bond No."].dropna().reset_index(drop=True)
bd_data["Withdraw Bonds"] = C_col
bd_data

bd_data.to_excel("C:\\Bonds_list.xlsx", index=False)

# C_col.to_excel("C:\\Bonds_list.xlsx", index=False)
# Book_1.reset_index()

# bd_data = pd.DataFrame(new)
# print(new)
# print(len(Bonds_data['100']))

In [ ]:
# for x in bd_data["Withdraw Bonds"]:
#     if x == np.nan:
#         pass
#     else:
#         print(x)

# bd_data["Withdraw Bonds"].isin(bd_data.columns.values).value_counts()
bd_data.columns

array(['100', '750', '100_2', '100_3', '200', '200_2', '1500',
       'Withdraw Bonds'], dtype=object)

In [ ]:
sample = {
    "100": range(0,100),
    "200": range(100,200),
    "300": range(200,300)
}
sample_var = pd.DataFrame(sample)
ran = [np.random.randint(1,300) for x in range(5)]
for col in sample_var.columns:
    for x in sample[col]:
        for j in ran:
            if x == j:
                print(f"{x} is present in list")

3 is present in list
161 is present in list
169 is present in list
191 is present in list
220 is present in list

In [ ]:
orignal =pd.DataFrame({
    "100": [x for x in range(509651,509700)],
    
    "750": [709688,709689,709690,709691,709692,
            709693,709694,709695,709696,709697,756025,806552,806553,806554,
            806555,901375,915271,999168],
    
})

additional = pd.DataFrame({
    "100_2": [x for x in range(517551,517600)],
})
additiona_2 = pd.DataFrame({
    "100_3": [x for x in range(526201,526300)]
})
additiona_3 = pd.DataFrame({
    "200": [480206,489481,490799,494736,500572,
            507947,523496,524665,534191,548503,565456,566722,597645,597646,
            597648,597649,597650,650343,673441,677654,677655,677656,677660,
            677668,719084,725605,731797,810586,912426,912427,930218,576471,
            250728,673448,679801,679804,901722,978226,797607,797356,798071,
            797560,109279,164563,'021391',577775,649422,671200,250728],
})
additiona_4 = pd.DataFrame({
    "200_2": [x for x in range(224101,224200)],
})
additiona_5 = pd.DataFrame({
    "1500": ['021397',106280,201308,485247,584445,675847,821113,821114,877318,
             877319,199747,'023246',551744,844327,293945,448470,908826]
})
new = pd.concat([orignal,additional,additiona_2,additiona_3,additiona_4,additiona_5], axis=1)

bd_data = pd.DataFrame(new)

Book_1 = pd.read_excel("C:\\bonds\\Book1.xlsx")
# Book_1.dropna().reset_index(drop=True)
C_col = Book_1["Bond No."].dropna().reset_index(drop=True)
bd_data["Withdraw Bonds"] = C_col
for col in bd_data.iloc[:,:-1]:
    for x in bd_data[col]:
        for y in bd_data["Withdraw Bonds"]:
            if y == x:
                print(f"{y} is present in list")




# bd_data.to_excel("C:\\Bonds_list.xlsx", index=False)

# C_col.to_excel("C:\\Bonds_list.xlsx", index=False)
# Book_1.reset_index()

499671.0 is present in list
516206.0 is present in list
516244.0 is present in list
516247.0 is present in list
516278.0 is present in list
565456.0 is present in list
677655.0 is present in list
214130.0 is present in list

### Few Real life Examples by AI

## Financial Data Analysis

In [ ]:
import pandas as pd
df = pd.read_csv('stock_prices.csv')  # Load stock data
df['Date'] = pd.to_datetime(df['Date'])  # Convert Date column to datetime
df.set_index('Date', inplace=True)  # Set Date as index
df['MA50'] = df['Close'].rolling(window=50).mean()  # Calculate 50-day moving average
df['MA200'] = df['Close'].rolling(window=200).mean()  # Calculate 200-day moving average
print(df[['Close', 'MA50', 'MA200']].tail())  # Display the moving averages

## Sales and Marketing Analytics

In [ ]:
# Use Case: Analyzing sales data to identify trends and optimize marketing strategies.

# Example: A company can load sales data, group by different products or regions, and calculate total revenue or sales growth rates.


df = pd.read_csv('sales_data.csv')  # Load sales data
df['Sales Growth'] = df['Current Sales'] / df['Previous Sales'] - 1  # Calculate sales growth
revenue_by_region = df.groupby('Region')['Revenue'].sum()  # Calculate total revenue by region
print(revenue_by_region)

## Customer Segmentation

In [ ]:
# Use Case: Segment customers based on purchasing patterns for targeted marketing.

# Example: You can group customers based on their purchase frequency and average order value.

df = pd.read_csv('customer_data.csv')
df['Total Purchase Value'] = df['Quantity'] * df['Price']  # Calculate total purchase value per order
customer_segments = df.groupby('CustomerID')['Total Purchase Value'].sum()  # Total purchases per customer
df['Segment'] = pd.qcut(df['Total Purchase Value'], q=4, labels=['Low', 'Medium', 'High', 'VIP'])  # Segment customers
print(df[['CustomerID', 'Segment']].head())

## Healthcare Data Analysis

In [ ]:
# Use Case: Analyzing patient data to identify health trends.

# Example: Hospitals can load patient data and analyze statistics on common illnesses, length of hospital stays, or treatments based on patient demographics

df = pd.read_csv('patient_data.csv')
avg_stay = df.groupby('Disease')['Hospital Stay Days'].mean()  # Average length of stay by disease
disease_counts = df['Disease'].value_counts()  # Count occurrences of each disease
print(avg_stay)
print(disease_counts)

## E-Commerce

In [ ]:
# Use Case: Understanding product trends and customer behavior on e-commerce websites.

# Example: A company can track website visitors’ behavior, which products they view, and their purchase histories.

df = pd.read_csv('ecommerce_data.csv')
df['Visit to Purchase Ratio'] = df['Purchases'] / df['Page Views']  # Calculate conversion rate
most_popular_product = df.groupby('Product')['Purchases'].sum().idxmax()  # Most purchased product
print(f"The most popular product is: {most_popular_product}")